run/rhoVoF/rotateSubstrate/reducedCase/common/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//For incompressible flow pressure becomes meaningless, if we dont have any gradients!

dimensions      [1 -1 -2 0 0 0 0];

internalField	uniform 1e5; //sea level as baseline...

boundaryField
{
    Top
    {
        type            fixedValue;
        value           uniform 0;
    }

    "(Mantle|Bottom)" //What does he mean with Mantle? -> Domain boundaries of air, or "walls" of the domain, see system/blockMeshDict file
    {
        type            zeroGradient; //fixedValue;
        //value           uniform 0;
    }

}

// ************************************************************************* //
