run/rhoVoF/rotateSubstrate/reducedCase/common/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------
#this script serves to run the pre steps for the simulation, check for mesh or set it up, check it, initialize fields


canCompile || exit 0    # Dynamic code (probably checks if the case works)

restore0Dir             #resets the 0 directory/ initial conditions

if [ ! -d constant/polyMesh ]   #checks if mesh file is existent, if NOT it will try to create it in the if clause
then
    runApplication blockMesh

    runApplication renumberMesh -overwrite -constant

    runApplication checkMesh -allTopology -allGeometry -constant
fi

#this next part is to initialize the Fields, function commands
runApplication setAlphaField
runApplication setExprFields

runApplication decomposePar
