run/rhoVoF/rotateSubstrate/reducedCase/common/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//This decomposes the domain into the defined number of subdomains, needed for parallelization


numberOfSubdomains 96; //100, 96 to match the 96 core of a node

method          scotch;

coeffs
{
    n           (4 2 12);	//sets the amount of "splits" into each direction of the domain, 4 in x, 2 in y, 12 in z, this multiplied needs/should to match the number of subdomains -> 96!
}

//(luis) The following is from https://github.com/HenningScheufler/multiDimAMR/tree/master README
constraints
{
    refinementHistoryMultiDim
    {
        //- Decompose cells such that all cell originating from single cell
        //  end up on same processor
        type    refinementHistoryMultiDim;
    }
}


// ************************************************************************* //
