run/rhoVoF/rotateSubstrate/reducedCase/common/system/meshingDimensions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshing; 
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//THIS FILE IS REFERENCED BY blockMeshDict!!!
//mainly calcs for the blockMeshDict script
//the parameterization variabels are @!...!@ (they are apparently a pyfoam specific notation), they are not used!


//radius  @!radius!@;
//N       @!n_base!@; //Not used here but referenced in blockMeshDict
//x_centre @!x_centre!@; 
//y_centre @!y_centre!@;
//z_centre @!z_centre!@;
//Nf		 @!resolution!@;

radius 0.0012; //actual experimental diameter is 0.0024, instead of given 0.00195
N 50; //250, (luis) this defines the initial amount of cells in each direction
x_centre 0.073; //Substrate impact radius, from redas pdf file with parameters
y_centre 0;
z_centre $radius; //Jun set it in example as radius, basically directly before impact, but is that correct? No time to accelerate. Does he somewhere declare the impact velocity as init? reda pdf says 3.1m/s -> impact velocity declared in setExprFieldDict
Nf 100; //used in "setAlphaField" 

posxWIDTH 10;
negxWIDTH 10;
posyWIDTH 10;
negyWIDTH 10;
poszWIDTH 9;
negzWIDTH 1;


posxHALF_WIDTH #eval{$radius * $posxWIDTH}; //@!posxWIDTH!@
negxHALF_WIDTH #eval{$radius * $negxWIDTH}; //@!negxWIDTH!@
posyHALF_WIDTH #eval{$radius * $posyWIDTH}; //@!posyWIDTH!@
negyHALF_WIDTH #eval{$radius * $negyWIDTH}; //@!negyWIDTH!@
poszHALF_WIDTH #eval{$radius * $poszWIDTH}; //@!poszWIDTH!@
negzHALF_WIDTH #eval{$radius * $negzWIDTH}; //@!negzWIDTH!@


C0 #eval{$x_centre - $negxHALF_WIDTH};
C1 #eval{$y_centre - $negyHALF_WIDTH};
C2 #eval{$x_centre + $posxHALF_WIDTH};
C3 #eval{$y_centre + $posyHALF_WIDTH};
H_START #eval{$z_centre - $negzHALF_WIDTH};
H_END #eval{$z_centre + $poszHALF_WIDTH};

// ************************************************************************* //
